<template>
    <div>
        <div class="notice_box" v-if="displayshow">
            <div class="tips_box">
                <h3>隐私政策</h3>
                <div class="xian"></div>
                <p>
                     1.1引言</br>
                        缘大师非常重视用户个人信息的保护，您的信任对我们非常重要，我们深知个人信息对您的重要性，我们将按法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。我们希望能够通过本《隐私政策》帮助您了解，在使用我们的服务时的以下问题：</br>
                    （1）缘大师收集哪些个人信息，如何收集、使用、储存和分享这些信息以及谁有权接触这些个人信息</br>
                    （2）什麽是cookies，它们是怎麽用的</br>
                    （3）缘大师的用户在披露个人信息时有哪些选择</br>
                    （4）缘大师的用户怎样接近、更新、控制、保护或删除他/她的信息</br>
                    （5）如果缘大师的用户对缘大师的隐私政策有问题，应该和谁联系</br>
                    &nbsp ;1.2 缘大师是一个多维度的网站。它向用户提供广泛的服务。因为缘大师的成功取决于建立与维护对用户的良好信誉，我们会坚定的实施保护我们用户隐私的措施。此外，我们认为自己有责任就在互联网上的隐私问题树立榜样并帮助建立有关标准。在登记过程中，每一项服务都要求用户提供不同类型和数量的个人信息。缘大师力图通过善意使用这些资料而为用户提供更好的服务。本隐私政策适用于您与缘大师页面的交互行为以及您登记和使用缘大师的在线服务。除了在本隐私政策和服务条款以及其他公布的准则的规定的情况下，我们不会公布与用户个人身份有关的资料。请注意缘大师不时地会检查其隐私措施，因此有关的措施会随之变化。我们恳请您定期光顾本页以确保对我们隐私政策最新版本始终保持了解。您使用或继续使用我们的服务，即意味着同意我们按照本《隐私政策》收集、使用、储存和分享您的相关信息。
                    1.2.1 在阅读完本政策之后，如您对本《隐私政策》或与相关的事宜有任何问题，请通过839640333@qq.com与我们联系。</br>
                    1.3 您使用服务时我们可能收集如下两类信息：</br>
                    （1）与个人身份无关的信息：
                    设备或软件信息，例如您的移动设备、网页浏览器或用于接入我们服务的其他程序所提供的配置信息、您的IP地址和移动设备所用的版本和设备识别码；有关您曾使用的移动应用（APP）和其他软件的信息，以及您曾经使用该等移动应用和软件的信息。</br>
                    （2）有关个人身份的信息：
                    在缘大师的某些区域，比如在问答里用户会被要求提供生日等信息，这类关于个人身份的信息主要是为了用户能够使用缘大师的问答服务。我们将尽力保护您个人信息的安全。当您发现缘大师的用户不正当地收集或使用您或他人的信息时，请通过839640333@qq.com与我们联系。
                    1.3.1 上述两类信息的来源及缘大师搜集这些信息的途径：</br>
                    （1）您提供的信息
                    （2）您在注册我们的账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件等；
                    （3）您通过我们的服务向其他方提供的共享信息，以及您使用我们的服务时所储存的信息。
                    1.3.2 其他方分享的您的信息</br>
                    （1）其他方使用我们的服务时所提供有关您的共享信息。
                    （2）我们获取的您的信息
                    7.3.3 您使用我们服务时我们可能收集如下信息：</br>
                    日志信息指您使用我们服务时，系统可能会通过cookies、web beacon或其他方式自动采集的技术信息，包括：设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们的服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备识别码。
                    1.4我们如何使用您的信息</br>
                    1.4.1我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</br>
                    （1）向您提供服务；</br>
                    （2）在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</br>
                    （3）帮助我们设计新服务，改善我们现有服务；</br>
                    （4）使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应；</br>
                    （5）向您提供与您更加相关的广告以替代普遍投放的广告；</br>
                    （6）评估我们服务中的广告和其他促销及推广活动的效果，并加以改善；</br>
                    （7）软件认证或管理软件升级；</br>
                    （8）让您参与有关我们产品和服务的调查。</br></br></br></br>
                    7.4.2 为了让我们的用户有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的个人信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的您的个人信息，可能在另一服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息。如我们在相关服务之中提供了相应选项，您也可以主动要求我们将您在该服务所提供和储存的个人信息用于我们的其他服务。
                    针对某些特定服务的特定个人信息保护声明将更具体地说明我们在该等服务中如何使用您的信息。
                    1.5 如何访问和控制您的信息</br>
                    1.5.1 我们将尽量采取适当的技术手段，保证您可以访问、更新和更正您的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全。</br>
                    对于通过cookies和web beacon收集的您的信息，我们还在以下“COOKIES、日志档案和WEB BEACON”部分说明了向您提供的选择机制。
                    1.5.2 我们如何分享您的信息</br>
                    除以下情形外，未经您同意，我们不会与任何第三方分享您的个人信息：
                    （1）我们可能将您的个人信息与我们的合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、以及为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在法域），用作下列用途：</br>
                    （2）向您提供我们的服务；</br>
                    （3）实现“我们如何使用您的信息”部分所述目的；</br>
                    （4）履行我们在本《隐私政策》或缘大师与您达成的其他协议中的义务和行使我们的权利；</br>
                    （5）理解、维护和改善我们的服务。</br>
                    1.5.3 如我们与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《隐私政策》及我们要求其遵守的其他适当的保密和安全措施。</br>
                    1.6 我们还可能为以下原因需要保留、保存或披露您的个人信息：</br>
                    （1）您授权或同意缘大师披露的；</br>
                    （2）遵守适用的法律法规；</br>
                    （3）遵守法院命令或其他法律程序的规定；</br>
                    （4）遵守相关政府机关的要求；</br>
                    （5）我们认为为遵守适用的法律法规、维护社会公共利益、或保护我们或我们的集团公司、我们的客户、其他用户或雇员的人身和财产安全或合法权益或公共安全及利益所合理必需的；</br>
                    （6）根据缘大师各服务条款及声明中的相关规定，或者缘大师认为必要的其他情形下。</br>
                    1.7 我们如何保留、储存和保护您的信息</br>
                    （1）我们仅在本《隐私政策》所述目的所必需期间和法律法规要求的时限内保留您的个人信息。</br>
                    （2）我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）来保护您向我们提供的个人信息。但请您谅解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。</br>
                    （3）有关共享信息的提示</br>
                    1.8 我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是我们的社交媒体服务，是专为使您可以与世界各地的用户共享信息而设计，从而使共享信息可实时、广泛的传递。只要您不删除共享信息，有关信息便一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。</br>
                    因此，请您认真考虑您通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您的共享信息的用户范围
                    缘大师的用户总是可以选择是否披露信息。有些信息是登记我们的服务所必需的，但大多数其他信息的提供是由用户决定的。缘大师将视用户舒适度及自主选择为首位。
                    缘大师为用户提供不计其数的网络互动活动，为便于用户参予互动活动并获取互动奖品，缘大师通常要求申请者在联系方法(通讯地址和电话)之外，还要根据其个人兴趣填写表格。此类信息被缘大师用来累积其用户的数据。如果用户不想提供所要求的信息和参加此类活动，这完全由用户自行决定。</br>
                    1.9 有关信息更新与公开的特别提示</br>
                    缘大师鼓励用户更新和修改其个人信息以使其有效。缘大师用户能在任何时候非常容易地获取并修改其个人信息。用户可以自行决定修改、删除他们的相关资料。
                    请记住，无论何时您自愿披露个人信息（如在评论区公布）， 此种信息可能被他人收集及使用，因此造成您的个人信息泄露，缘大师不承担责任，如果您将个人信息公布在上述渠道，您就有可能造成个人信息泄露。因此，我们提醒并请您慎重考虑是否有必要在上述渠道公开您的个人信息。</br>
                    1.10 有关敏感个人信息的提示</br>
                    某些个人信息因其特殊性可能被认为是敏感个人信息，例如您的种族、宗教、个人健康和医疗信息等。
                    请注意，您在我们的服务中所提供、上传或发布的内容和信息（例如有关您社交活动的照片或信息），可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否使用我们的服务披露您的敏感个人信息。
                    您同意您的敏感个人信息按本《隐私政策》所述的目的和方式来处理。</br>
                    1.11 COOKIES、日志档案和WEB BEACON</br>
                    （1）缘大师使用Cookies是为了让其用户受益。比如，为使得缘大师虚拟社区的登录过程更快捷，用户们可以选择把用户名和口令存在一个Cookies中。这样下次当用户要登录缘大师的服务时，只要点击一键就可以了。Cookies能帮助我们确定您连接的页面和内容，您在缘大师特定网页上花费的时间和您所选择的缘大师的服务。</br>
                    （2）Cookies是放置在缘大师的计算机或服务器上的您的身份证。Cookies只能被设置它们的服务器阅读，而且不能执行任何代码或病毒。Cookies使得缘大师能更好、更快地为您服务，并且使您在缘大师网页上的经历更富个性化。然而，您应该能够控制Cookies是否以及怎样被你的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。简而言之，缘大师将Cookies当作一种便捷的体验，其作用是使得用户在从缘大师的一项服务转到另一项服务时，无须再证明自己的身份。</br>
                    （3）我们和第三方合作伙伴可能通过cookies和web beacon收集和使用您的信息，并将该等信息储存。
                    1.12 我们使用自己的cookies和web beacon，用于以下用途：</br>
                    （1）记住您的身份。例如：cookies和web beacon有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供有关您的喜好或其他信息；</br>
                    （2）分析您使用我们服务的情况。我们可利用cookies和web beacon来了解您使用我们的服务进行什么活动、或哪些网页或服务最受欢迎。</br>
                    （3）您可以通过浏览器或用户选择机制拒绝或管理cookies或web beacon。但请您注意，如果您停用cookies或web beacon，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。</br>
                    1.13 与服务有关的公告</br>
                    我们可能在必需时（例如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
                    1.14 我们服务中的第三方服务</br>
                    我们的服务可能包括或链接至第三方提供的社交媒体或其他服务（包括网站）。例如：
                    （1）可利用 “分享”键将某些内容分享到我们的服务，或您可利用第三方连线服务登录我们的服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；</br>
                    （2）该等第三方社交媒体或其他服务由相关的第三方负责运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受第三方自己的服务条款及个人信息保护声明（而非本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的任何信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，而我们对任何第三方使用由您提供的信息不承担任何责任。
                    1.15 年龄限制</br>
                    （1）缘大师建议：任何未成年人参加网上活动应事先取得家长或其法定监护人（以下简称"监护人"）的同意。缘大师将根据国家相关法律法规的规定保护未成年人的相关信息。</br>
                    （2）我们鼓励父母或监护人指导未满十八岁的未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交个人信息之前寻求父母或监护人的同意和指导。</br>
                    1.16 本《隐私政策》的适用范围</br>
                    1.16.1 除某些特定服务外，我们所有的服务均适用本《隐私政策》。这些特定服务将适用特定的个人信息保护声明。该特定服务的个人信息保护声明构成本《隐私政策》的一部分。如任何特定服务的个人信息保护声明与本《隐私政策》有不一致之处，则适用特定服务的个人信息保护声明。
                    除本《隐私政策》另有规定外，本《隐私政策》所用词语将与缘大师制定的其他公开条款所定义的词语具有相同的涵义。</br>
                    1.16.2 请您注意，本《隐私政策》不适用于以下情况：</br>
                    （1）通过我们的服务而接入的第三方服务（包括任何第三方网站）收集的信息；
                    （2）通过在我们服务中进行广告服务的其他公司和机构所收集的信息。
                    1.17 本《隐私政策》的修改</br>
                    （1）我们可能随时修改本《隐私政策》的条款，该等修改构成本《隐私政策》的一部分。如该等修改造成您在本《隐私政策》下权利的实质减少，您可以选择停止使用我们向您提供的服务；在该种情况下，若您仍然继续使用我们的服务的，即表示同意受经修订的本《隐私政策》的约束。</br>
                    （2）任何修改都会将您的满意度置于首位。我们鼓励您在每次访问缘大师的网页时都查阅我们的隐私政策。</br>
                    最后，您是唯一对您的账号和密码信息负有保密责任的人。任何情况下，请小心妥善保管。
                    （3）有关本声明或缘大师的隐私措施的问题请与缘大师协调人联系839640333@qq.com。</br>
                </p>
                <div class="show">
                    <a href="javascript:;" @click="shop">
                        <img src="../assets/home/popup_close_button@2x.png" alt="">
                    </a>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
            displayshow: false,
            value: "",
            num: 0,
            info: ""
        }
    },
    mounted(){
     
    },
    methods: {
        shop() {
            this.displayshow = false
            this.$emit("showgg")
        },
        show() {
            this.displayshow = true
        },
        shuru() {
            console.log(666);

        }
    },
    watch: {
        info() {
            this.num = this.info.length
        }
    }
}
</script>

<style lang="scss" scoped>
.notice_box {
  top: 0;
  left: 0;
  position: fixed;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.7);
  z-index: 10;
   display: flex;
  justify-content: center;
  align-items: center;
  .tips_box {
    width: 630px;
    height: 869px;
    background: #fff;
    border-radius: 10px;
    // margin:auto;
    // margin-top: 10%;
    padding: 30px;
    position: relative;
    .xian {
      width: 100%;
      height: 1px;
      background: rgba(241, 241, 241, 1);
     margin-bottom: 10px;
    }
    p {
      color: #333333;
      font-size: 28px;
      margin-top: 20px;
      width: 580px;
      height: 672px;
      overflow: auto;
    }
    h3 {
      transform: translateY(-43px);
      line-height: 82px;
      margin: 0 auto;
      width: 361px;
      height: 82px;
      text-align: center;
      font-size: 32px;
      font-family: PingFang-SC-Bold;
      font-weight: bold;
      color: #FF3E94;
      background: url('../assets/home/img_biaoti_gaobai@2x.png') no-repeat;
      background-size: 100%;
    }
    ul {
      margin-top: 80px;
      display: flex;
      justify-content: space-between;
      li {
        padding: 28px 24px;
        border-radius: 10px;
        background-color: #f8f8f8;
        color: rgba(51, 51, 51, 1);
        font-size: 26px;
        font-family: PingFang-SC-Bold;
        font-weight: bold;
      }
      li.active {
        padding: 28px 24px;
        border-radius: 10px;
        background: rgba(248, 235, 226, 1);
        color: rgba(83, 47, 19, 1);
        font-size: 26px;
        font-family: PingFang-SC-Bold;
        font-weight: bold;
      }
    }
    .input_box {
      margin-top: 35px;

      textarea {
        display: block;
        width: 569px;
        height: 409px;
        background: rgba(245, 245, 245, 1);
        border-radius: 10px;
        border: none;
        resize: none;
        padding: 25px;
      }
    }
    .num {
      text-align: right;
      font-family: PingFang-SC-Medium;
      font-weight: 500;
      color: rgba(153, 153, 153, 1);
      line-height: 38px;
      font-size: 24px;
      margin-top: 10px;
    }
    .submit {
      width: 217px;
      height: 76px;
      margin: 0 auto;
      a {
        display: inline-block;
        img {
          width: 100%;
          height: 100%;
        }
      }
    }
    .show {
      position: absolute;
      width: 60px;
      height: 60px;
      bottom: -120px;
      left: 285px;
      a {
        display: inline-block;
        img {
          width: 100%;
          height: 100%;
        }
      }
    }
  }
}
</style>
